Tekla Open API Reference for Tekla Structures 2025
Double.Equals Method
Overload List
Name | Description
Equals(Object)
 Returns a value that indicates whether the current instance is equal to the given object.
 (Overrides ValueType.Equals(Object).)
Equals(Double)
 Indicates whether the current object is equal to another object of the same type.
Top
See Also
Reference
Double Structure
Tekla.Structures.Datatype Namespace